-- 1.给指定列添加数据
# INSERT INTO 表名(列名1,列名2,...) VALUES(值1,值2,...);
# 实际上有多列存在(id, name, age, sex, address, math, english, hire_date)
# 但是我只给这些列添加数据
INSERT INTO demo1(id, name, age)
VALUES (1, 'demo1', 55);
##############################################################################
-- 2.给全部列添加数据
# INSERT INTO 表名 VALUES(值1,值2,...);
# 这里最大的区别是，不写列名，但是不写列名可能出现异常

INSERT INTO demo1
VALUES (1, 'demo1', 55, '男', '深圳', 66, 78, '2010-01-01');
-- 单行添加数据
INSERT into st_table(id, name, price)
VALUES (123, '123', '322');
-- 如果可以为null，那么不插入数据的情况下，栏目不对，会报错
# Column count doesn't match value count at row 1
# INSERT into st_table(id, name, price) VALUES (12, '123');
INSERT into st_table(id, name, price)
VALUES (11, '123', '322');
##############################################################################
-- 3.批量添加数据
# INSERT INTO 表名(列名1,列名2,...) VALUES(值1,值2,...),(值1,值2,...),(值1,值2,...)...;
INSERT INTO demo1(id, name, age, sex, address, math, english, hire_date)
VALUES (1, 'demo1', 55, '男', '深圳', 66, 78, '2010-01-01'),
       (1, 'demo1', 55, '男', '深圳', 66, 78, '2010-01-01');

# 下面这种不写列名也可以
-- 在给所有行添加数据的情况下，可以省略栏目名称
# INSERT INTO 表名 VALUES(值1,值2,...),(值1,值2,...),(值1,值2...)...;
INSERT INTO demo1
VALUES (1, 'demo1', 55, '男', '深圳', 66, 78, '2010-01-01'),
       (1, 'demo1', 55, '男', '深圳', 66, 78, '2010-01-01');
##############################################################################
##############################################################################
##############################################################################


-- 直接给多行添加数据，就在后面跟多行的数据内容
INSERT into st_table(id, name, price)
VALUES (21, '123', '322'),
       (31, '123', '322'),
       (41, '123', '322');


-- 添加数据
insert into tb_brand (brand_name, company_name, ordered, description, status)
values ('华为', '华为技术有限公司', 100, '万物互联', 1),
       ('小米', '小米科技有限公司', 50, 'are you ok', 1),
       ('格力', '格力电器股份有限公司', 30, '让世界爱上中国造', 1),
       ('阿里巴巴', '阿里巴巴集团控股有限公司', 10, '买买买', 1),
       ('腾讯', '腾讯计算机系统有限公司', 50, '玩玩玩', 0),
       ('百度', '百度在线网络技术公司', 5, '搜搜搜', 0),
       ('京东', '北京京东世纪贸易有限公司', 40, '就是快', 1),
       ('小米', '小米科技有限公司', 50, 'are you ok', 1),
       ('三只松鼠', '三只松鼠股份有限公司', 5, '好吃不上火', 0),
       ('华为', '华为技术有限公司', 100, '万物互联', 1),
       ('小米', '小米科技有限公司', 50, 'are you ok', 1),
       ('格力', '格力电器股份有限公司', 30, '让世界爱上中国造', 1),
       ('阿里巴巴', '阿里巴巴集团控股有限公司', 10, '买买买', 1),
       ('腾讯', '腾讯计算机系统有限公司', 50, '玩玩玩', 0),
       ('百度', '百度在线网络技术公司', 5, '搜搜搜', 0),
       ('京东', '北京京东世纪贸易有限公司', 40, '就是快', 1),
       ('华为', '华为技术有限公司', 100, '万物互联', 1),
       ('小米', '小米科技有限公司', 50, 'are you ok', 1),
       ('格力', '格力电器股份有限公司', 30, '让世界爱上中国造', 1),
       ('阿里巴巴', '阿里巴巴集团控股有限公司', 10, '买买买', 1),
       ('腾讯', '腾讯计算机系统有限公司', 50, '玩玩玩', 0),
       ('百度', '百度在线网络技术公司', 5, '搜搜搜', 0),
       ('京东', '北京京东世纪贸易有限公司', 40, '就是快', 1),
       ('小米', '小米科技有限公司', 50, 'are you ok', 1),
       ('三只松鼠', '三只松鼠股份有限公司', 5, '好吃不上火', 0),
       ('华为', '华为技术有限公司', 100, '万物互联', 1),
       ('小米', '小米科技有限公司', 50, 'are you ok', 1),
       ('格力', '格力电器股份有限公司', 30, '让世界爱上中国造', 1),
       ('阿里巴巴', '阿里巴巴集团控股有限公司', 10, '买买买', 1),
       ('腾讯', '腾讯计算机系统有限公司', 50, '玩玩玩', 0),
       ('百度', '百度在线网络技术公司', 5, '搜搜搜', 0),
       ('京东', '北京京东世纪贸易有限公司', 40, '就是快', 1),
       ('华为', '华为技术有限公司', 100, '万物互联', 1),
       ('小米', '小米科技有限公司', 50, 'are you ok', 1),
       ('格力', '格力电器股份有限公司', 30, '让世界爱上中国造', 1),
       ('阿里巴巴', '阿里巴巴集团控股有限公司', 10, '买买买', 1),
       ('腾讯', '腾讯计算机系统有限公司', 50, '玩玩玩', 0),
       ('百度', '百度在线网络技术公司', 5, '搜搜搜', 0),
       ('京东', '北京京东世纪贸易有限公司', 40, '就是快', 1),
       ('小米', '小米科技有限公司', 50, 'are you ok', 1),
       ('三只松鼠', '三只松鼠股份有限公司', 5, '好吃不上火', 0),
       ('华为', '华为技术有限公司', 100, '万物互联', 1),
       ('小米', '小米科技有限公司', 50, 'are you ok', 1),
       ('格力', '格力电器股份有限公司', 30, '让世界爱上中国造', 1),
       ('阿里巴巴', '阿里巴巴集团控股有限公司', 10, '买买买', 1),
       ('腾讯', '腾讯计算机系统有限公司', 50, '玩玩玩', 0),
       ('百度', '百度在线网络技术公司', 5, '搜搜搜', 0),
       ('京东', '北京京东世纪贸易有限公司', 40, '就是快', 1)
;
